Octopustank/stm32-multifunction-embedded-toy/Core/Src/main.c
/* ---- MQTT Thread (periodic sensor publish) ------------------------------- */

static void mqtt_thread_entry(void *param)
{
    rt_thread_mdelay(5000);

    while (1) {
        if (!mqtt_connected) {
            rt_thread_mdelay(1000);
            continue;
        }

        rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
        struct SensorData local = sensor_data;
        rt_mutex_release(&sensor_mutex);

        char payload[128];
        snprintf(payload, sizeof(payload),
            "{\"t\":%d.%d,\"h\":%d.%d,\"l\":%u,\"d\":%u}",
            (int)local.temp, (int)((local.temp-(int)local.temp)*10+0.5f),
            (int)local.humi, (int)((local.humi-(int)local.humi)*10+0.5f),
            local.light, local.distance);

        if (ESP8266_MqttPub("sensor/data", (uint8_t*)payload, strlen(payload)) < 0) {
            mqtt_connected = 0;
        }
        rt_thread_mdelay(10000);
    }
}

/* ---- Game Thread (snake on MAX7219) -------------------------------------- */

static void game_thread_entry(void *param)
{
    const uint8_t smiley[8] = {
        0x00, 0x24, 0x24, 0x00, 0x00, 0x42, 0x3C, 0x00
    };
    static int prev_mode;

    while (1) {
        if (!game_mode) {
            if (prev_mode) { max7219_display(smiley); prev_mode = 0; }
            rt_thread_mdelay(100);
            continue;
        }
        prev_mode = game_mode;

        if (game_mode == 1) {
            snake_tick(g_dir);
            g_dir = DIR_NONE;

            uint8_t rows[8];
            snake_get_display(rows);
            max7219_display(rows);

            if (snake_is_dead()) game_mode = 2;
            rt_thread_mdelay(snake_get_speed_ms());
            continue;
        }

        if (game_mode == 2) {
            const uint8_t all[8]  = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};
            const uint8_t none[8] = {0,0,0,0,0,0,0,0};
            for (int i = 0; i < 3; i++) {
                max7219_display(all);  rt_thread_mdelay(150);
                max7219_display(none); rt_thread_mdelay(150);
            }
            rt_thread_mdelay(500);
        }
    }
}

/* ---- Application Entry --------------------------------------------------- */
int main(void)
{
    MX_GPIO_Init();
    MX_I2C1_Init();
    ssd1306_Init(&hi2c1);
    MX_ADC1_Init();
    MX_USART2_UART_Init();
    MX_USART1_UART_Init();
    max7219_init();

    /* SR04 Trig pin (PB6): output push-pull */
    {
        GPIO_InitTypeDef s = {0};
        s.Pin   = TRIG_Pin;
        s.Mode  = GPIO_MODE_OUTPUT_PP;
        s.Pull  = GPIO_NOPULL;
        s.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(TRIG_GPIO_Port, &s);
        HAL_GPIO_WritePin(TRIG_GPIO_Port, TRIG_Pin, GPIO_PIN_RESET);
    }

    MX_TIM4_Init();
    HAL_TIM_Base_Start_IT(&htim4);             /* start timer counter */
    HAL_TIM_IC_Start_IT(&htim4, TIM_CHANNEL_2);
    __HAL_TIM_ENABLE_IT(&htim4, TIM_IT_UPDATE);  /* overflow interrupt */

    /* kernel objects (static init — no heap frag) */
    rt_mutex_init(&sensor_mutex, "s_mtx", RT_IPC_FLAG_FIFO);
    rt_mutex_init(&i2c_mutex,    "i_mtx", RT_IPC_FLAG_FIFO);
    rt_sem_init(&sensor_sem, "s_sem", 0, RT_IPC_FLAG_FIFO);
    rt_sem_init(&key_sem,    "k_sem", 0, RT_IPC_FLAG_FIFO);

    /* splash screen */
    ssd1306_Fill(Black);
    /* border */
    for (uint8_t x = 0; x < 128; x++) {
        ssd1306_DrawPixel(x,  0, White);
        ssd1306_DrawPixel(x, 63, White);
    }
    for (uint8_t y = 0; y < 64; y++) {
        ssd1306_DrawPixel(0,   y, White);
        ssd1306_DrawPixel(127, y, White);
    }
    /* title */
    ssd1306_SetCursor(20, 12);
    ssd1306_WriteString("RT-Thread", Font_11x18, White);
    ssd1306_SetCursor(30, 36);
    ssd1306_WriteString("Nano v3.1", Font_7x10, White);
    ssd1306_UpdateScreen(&hi2c1);
    rt_thread_mdelay(1500);
    ssd1306_Fill(Black);
    ssd1306_SetCursor(22, 20);
    ssd1306_WriteString("Init...", Font_11x18, White);
    ssd1306_UpdateScreen(&hi2c1);

    rt_thread_t tid;
    tid = rt_thread_create("sens", sensor_thread_entry, RT_NULL, 768,  8, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("oled", oled_thread_entry,   RT_NULL, 1024, 12, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("led",  led_thread_entry,    RT_NULL, 512,  11, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("keys", key_thread_entry,    RT_NULL, 384,  10, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("shell", shell_thread_entry,  RT_NULL, 768,  15, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("mqtt",  mqtt_thread_entry,   RT_NULL, 1024, 14, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("game",  game_thread_entry,   RT_NULL, 640,   9, 10);
    if (tid) rt_thread_startup(tid);

    while (1) rt_thread_mdelay(1000);
    return RT_EOK;
}

/* ---- System Clock Configuration (called from board.c) ------------------- */

void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
        Error_Handler();

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                                  |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
        Error_Handler();
}

void Error_Handler(void)
{
    __disable_irq();
    while (1) {}
}
